import React, { useState } from 'react';
import Modal from 'react-bootstrap/Modal';


const ModalPolicy = () => {
  const [show, setShow] = useState(false);
  return (
    <div>
      <a onClick={() => setShow(true)}>
        Условия аренды
      </a>

      <Modal
        show={show}
        onHide={() => setShow(false)}
        dialogClassName="modal-90w"
        aria-labelledby="example-custom-modal-styling-title"
      >
        <Modal.Header closeButton>
          <Modal.Title id="example-custom-modal-styling-title">
            Договір-оферта
            про оплатне
            надання послуг
            коворкінгу
          </Modal.Title>
        </Modal.Header>
        <Modal.Body>
          <div>
            <p></p>
            <p><br />
              <br />
            </p>
            <p>Цей документ
            є пропозицією
            Фізичної
            особи-підприємця
            Стоянова Романа
            Олександровича
            укласти Договір
            про оплатне
            надання Послуг
            на викладених
            нижче умовах
            з будь-якою
            особою (далі
            ― Замовник),
            якою прийняті
            умови цієї
Оферти.</p>
            <p>1. Визначення
та терміни</p>
            <p>Нижчеподані
            терміни мають
            таке значення
            тільки для
            даного Договору
            і не можуть
            тлумачитися
            інакше стосовно
            послуг, що надаються
за цим Договором:</p>
            <p>1.1. У цілях
            цього документа
            нижченаведені
            терміни використовуються
в такому значенні:</p>
            <p>Коворкінг
            - частина нежитлових
            приміщень,
            розміщених
            за адресою:
</p>
            <p>м. Миколаїв,
пр. Миру 11/11.</p>
            <p>Оферта
            - цей документ
            «Договір-оферта
            про оплатне
            надання послуг
            коворкінгу»,
            розміщений
            у мережі інтернет
            за адресою:
https://clients.aihelps.com/110043.</p>
            <p>Послуги
            коворкінгу
            - послуги, пов’язані
            з наданням
            Замовнику місця
            для реалізації
            ним самостійної
            діяльності
            (дзеркал, столів,
            стільців, джерел
            електроживлення,
            доступу до
            мережі інтернет
            та інших послуг
            у відповідності
            до обраного
            тарифу) а також
            додаткових
            послуг. Надалі,
            у цьому Договорі,
            додатках та
            додаткових
            угодах до нього
            послуги, пов’язані
            з наданням
            місця замовнику
            іменуються
            як «надання
            робочого місця»,
            що жодним чином
            не може трактуватися
            як наявність
            будь-яких  трудових
            та/або цивільно-правових
            відносин між
            Замоником та
            Виконавцем,
            за виключенням
            безпосереднього
            надання послуг
            Коворкінгу
            у відповідності
            до обраного
            тарифу та додаткових
            послуг. Жодні
            норми трудового
            законодавства
            до відносин
сторін незастосовні.</p>
            <p>Акцепт
            Оферти - повне
            та беззастережне
            прийняття
            Оферти шляхом
            виконання дій,
            зазначених
            у розділі 7 Оферти.
            Акцептом Оферти
            укладається
Договір.</p>
            <p>Договір
            - платний договір
            між Замовником
            і Виконавцем
            на надання
            Послуг, який
            укладається
            за допомогою
Акцепту Оферти.</p>
            <p>Замовник
            - фізична особа
            або фізична
            особа-підприємець,
            яка уклала з
            Виконавцем
            Договір за
            допомогою
            Акцепту Оферти
            та має повну
            цивільну
дієздатність.</p>
            <p>2. Предмет
договору</p>
            <p>2.1. Предметом
            Договору є
            платне надання
            Виконавецем
            Замовнику
            Послуг на умовах
Оферти.</p>
            <p>3. Права
            та зобов`язання
виконавця</p>
            <p>3.1. Виконавець
            зобов'язується
            надати Замовнику
            Послуги відповідно
            до Договору,
            укладеного
на умовах Оферти.</p>
            <p>3.2. Виконавець
            зобов’язується
            забезпечувати
            чистоту та
            комфортну
            температуру
            в Коворкінгу,
            вживати заходів
            до забезпечення
            постачання
            електроенергії,
            гарячої та
            холодної води.
</p>
            <p>3.2. Виконавець
            має право залучати
            третіх осіб
            для виконання
            своїх зобов'язань
            по наданню
Послуг за Договором.</p>
            <p>3.3. Виконавець
            має право змінити
            Оферту, як це
            передбачено
в п. 8.2 цієї Оферти.</p>
            <p>3.4. Виконавець
            має право публікувати
            та поширювати
            інформацію
            про хід, спосіб
            та результати
            надання Послуг
            Замовнику,
            дотримуючись
            Закону України
            «Про захист
            персональних
даних».</p>
            <p>4. Права
            та зобов`язання
замовника</p>
            <p>4.1. Замовник
            зобов'язується
            сплачувати
            Послуги Виконавця
            з Договору у
            встановлені
            в Оферті (Договорі)
строки та порядку.</p>
            <p>4.2. Після
            отримання
            Послуг Замовник
            зобов'язується
            повернути
            робоче місце
            в тому стані,
            у якому воно
було отримано.</p>
            <p>4.3. Замовник
            має право
            користуватись
            допоміжними
            приміщеннями
            (туалет, кухня
тощо).</p>
            <p>4.4. Замовник
            не має право
            використовувати
            адресу Коворкінга
            як свою юридичну
            адресу або як
            адресу проведення
            господарської
            діяльності
            у офіційних
документах.</p>
            <p>5. Вартість
            послуг і умови
оплати</p>
            <p>5.1. Вартість
            та обсяг Послуг,
            що надаються
            Виконавцем
            за Договором,
            визначається
            п. 5.5. до цього
Договору.</p>
            <p>5.2. Оплата
            Послуг здійснюється
            Замовником
            в українських
            гривнях у готівковому
            та безготівковому
            порядку на
            розрахунковий
            рахунок Виконавця,
            вказаний у
розділі 13 Оферти.</p>
            <p>5.3. Послуги
            надаються
            Замовнику на
            умовах попередньої
            оплати. Замовник
            робить авансовий
            платіж у розмірі
            100% (ста відсотків)
            від вартості
            Послуг, що
            замовляються
            згідно обраного
            тарифу, передбаченого
            п.5.5. до цього
            Договору.
</p>
            <p>5.4. Послуги
            вважаються
            сплаченими
            Замовником
            з моменту отримання
            Виконавцем
            коштів готівкою
            або підтвердження
            з банку про
            надходження
            всієї суми
            оплати на
            розрахунковий
            рахунок Виконавця.
            В окремих випадках
            на власний
            розсуд Виконавця
            підтвердженням
            факту безготівкової
            оплати може
            бути: а) факсимільна
            копія платіжного
            доручення у
            разі безготівкової
            форми оплати;
            б) факсимільна
            копія квитанції
            про оплату з
            печаткою банку,
            через який
            здійснено
            оплату; в) верифікація
            Виконавцем
            факту платежу
            на користь
            Виконавця через
            платіжну систему
            в разі здійснення
            Замовником
            електронного
платежу.</p>
            <p>5.5. Тарифи:</p>
            <p>- «Аренда
            на 1 час» - тривалість
            1 година, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 50 грн., для перукаря
            - 60 грн., для массажиста
            (лешмейкера
тощо) - 100 грн.;</p>
            <p>- «Аренда
            на 2 часа» - тривалість
            2 години, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 90 грн., для перукаря
            - 110 грн., для массажиста
            (лешмейкера
тощо) - 200 грн.;</p>
            <p>«Аренда
            на 3 часа» - тривалість
            3 години, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 125 грн., для перукаря
            - 150 грн., для массажиста
            (лешмейкера
тощо) - 300 грн.;</p>
            <p>«Аренда
            на 4 часа» - тривалість
            4 години, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 150 грн., для перукаря
            - 200 грн., для массажиста
            (лешмейкера
тощо) - 400 грн.;</p>
            <p>«Аренда
            на 6 часов» -
            тривалість
            3 години, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 150 грн., для перукаря
            - 230 грн., для массажиста
            (лешмейкера
тощо) - 400 грн.;</p>
            <p>«Аренда
            на день» - тривалість
            з 09.00 до 20.00, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 150 грн., для перукаря
            - 300 грн., для массажиста
            (лешмейкера
тощо) - 400 грн.;</p>
            <p>«Аренда
            на месяц», «Аренда
            на 15 смен», «Аренда
            на 15 дней»  - тривалість
            15 днів упродовж
            1 місяця, з 09.00 до
            20.00, вартість
            надання послуг
            коворкінгу:
            для візажиста
            - 1500 грн., для перукаря
- 3000 грн.;</p>
            <p>6. Порядок
            здавання-приймання
послуг</p>
            <p>6.1. Якщо
            впродовж 30
            календарних
            днів з дати
            сплати Рахунку
            Замовник не
            направляє
            письмову мотивовану
            відмову від
            прийняття
            Послуг особисто,
            за допомогою
            електронного
            або поштового
            зв'язку, Послуги
            вважаються
            наданими Виконавецем
            належним чином
            в повному обсязі
            і прийнятими
            Замовником
у повному обсязі.</p>
            <p>7. Акцепт
            оферти та укладення
договору</p>
            <p>7.1. Договір
            вважається
            акцептованим
            (укладеним)  у
            повному обсязі
            шляхом:
</p>
            <p>7.1.1. Підтвердження
            онлайн-запису
            у мережі Інтернет
            за посиланням:
https://clients.aihelps.com/110043.</p>
            <p>7.1.2. Підтвердження
            запису на надання
            послуг через
            листування
            у соціальних
            мережах, мессенджерах
            або телефонним
            дзвінком, із
            наданням ім′я
та номеру телефону.</p>
            <p>7.1.3. Шляхом
            підписання
            даного Договору
            вповноваженими
            особами Замовника
та Виконавця.</p>
            <p>8. Строк
            дії та зміна
умов оферти</p>
            <p>8.1. Виконавець
            починає надавати
            послуги за цим
            Договором в
            дату початку
надання послуг.</p>
            <p>8.2. Виконавець
            залишає за
            собою право
            внести зміни
            в умови Оферти
            та/або відкликати
            Оферту в будь-який
            момент на власний
            розсуд. У разі
            внесення Виконавцем
            змін в Оферту
            такі зміни
            набувають
            чинності з
            моменту розміщення
            зміненого
            тексту Оферти
            в мережі Інтернет
            за адресою:
            https://clients.aihelps.com/110043, якщо
            інший строк
            набуття чинності
            змін не визначено
            додатково під
            час такого
розміщення.</p>
            <p>9. Строк
            дії та зміна
договору</p>
            <p>9.1. Акцепт
            Оферти Замовником,
            здійснений
            згідно з розділом
            7 Оферти, створює
            Договір (стаття
            642 Цивільного
            кодексу України)
на умовах Оферти.</p>
            <p>9.2. Договір
            набуває чинності
            з моменту Акцепту
            Оферти Замовником
            і діє: а) до моменту
            виконання
            Сторонами
            зобов'язань
            за Договором,
            а саме оплати
            Замовником
            вартості Послуг
            і надання Виконавцем
            Послуг в обсязі,
            що відповідає
            вартості Послуг,
            або б) до моменту
            розірвання
Договору.</p>
            <p>9.3. Замовник
            погоджується
            та визнає, що
            внесення змін
            до Оферти спричинює
            внесення цих
            змін до укладеного
            та чинного між
            Замовником
            і Виконавцем
            Договору, і ці
            зміни в Договорі
            набувають
            чинності одночасно
            з такими змінами
в Оферті.</p>
            <p>9.4. У разі
            відкликання
            Оферти Виконавцем
            впродовж строку
            дії Договору
            Договір вважається
            припиненим
            з моменту
            відкликання,
            якщо інше не
            обумовлене
            Виконавцем
            під час відкликання
Оферти.</p>
            <p>10. Розірвання
договору</p>
            <p>10.1. Договір
            може бути розірваний
            за згодою Сторін
            у будь-який
час.</p>
            <p>10.2. Замовник
            має право в
            односторонньому
            порядку відмовитись
            від виконання
            Договору, при
            умові сплати
            Виконавцеві
            понесених ним
            витрат. При
            цьому Сторони
            домовились,
            що при односторонній
            відмові Замовника
            від виконання
            Договору пізніше
            ніж за 1 день
            до початку
            надання послуг
            Замовник
            зобов’язується
            сплатити 50% від
            вартості замовлених
            послуг.
</p>
            <p>10.3. Договір
            може бути розірваний
            на інших підставах,
            передбачених
цією Офертою.</p>
            <p>11. Гарантії</p>
            <p>11.1. За винятком
            гарантій, прямо
            зазначених
            у тексті Оферти,
            Виконавець
            не надає жодних
            інших прямих
            або домислюваних
            гарантій за
            Договором і
            прямо відмовляється
            від будь-яких
            гарантій або
            умов відносно
            непорушення
            прав, відповідності
            Послуг конкретним
цілям Замовника.</p>
            <p>11.2. Погоджуючись
            з умовами та
            приймаючи умови
            цієї Оферти
            шляхом Акцепту
            Оферти, Замовник
            запевняє Виконавця
            і гарантує
Виконавцю, що:</p>
            <p>11.2.1. Замовник
            надав достовірні
            дані, у тому
            числі персональні
дані Замовника.</p>
            <p>11.2.2. Замовник
            укладає Договір
            добровільно,
            при цьому Замовник:
            а) повністю
            ознайомився
            з умовами Оферти,
            б) повністю
            розуміє предмет
            Оферти та Договору,
            в) повністю
            розуміє значення
            та наслідки
            своїх дій щодо
            укладання та
            виконання
Договору.</p>
            <p>11.2.3. Замовник
            (представник
            Замовника) має
            всі права та
            повноваження,
            необхідні для
            укладання та
            виконання
Договору.</p>
            <p>11.2.4. В момент
            Акцепту Оферти
            Замовник надає
            Виконавцю свою
            згоду: 1) на включення
            Виконавцем
            всіх добровільно
            наданих ним
            персональних
            даних загального
            характеру до
            бази персональних
            даних, володільцем
            якої є Виконавець;
            2) на обробку
            його персональних
            даних з метою
            надання, отримання
            та здійснення
            розрахунків
            за послуги
            Виконавця, а
            також у зв'язку
            з виконанням
            Виконавцем
            приписів
            законодавства
            України; 3) на
            поширення
            (передачу) Виконавцем
            його персональних
            даних третім
            особам і на
            використання
            його персональних
            даних такими
            третіми особами
            з метою, яка
            визначена у
            цьому пункті,
            і підтверджує
            свою відмову
            від отримання
            повідомлення
            про таку передачу
            його персональних
            даних третім
особам.</p>
            <p>Замовник,
            здійснюючи
            Акцепт Оферти,
            підтверджує,
            що він повідомлений
            про включення
            його персональних
            даних до бази
            персональних
            даних, володільцем
            якої є Виконавець,
            з метою обробки
            персональних
            даних, зазначеної
            у цьому пункті,
            а також про
            свої права,
            зазначені у
            статті 8 Закону
            України «Про
            захист персональних
даних».</p>
            <p>12. Відповідальність
            і обмеження
відповідальності</p>
            <p>12.1. Сукупний
            розмір відповідальності
            Виконавця за
            Договором,
            включаючи
            розмір штрафних
            санкцій (пеней,
            неустойок)
            та/або відшкодовуваних
            збитків за
            будь-яким позовом
            або претензією
            відносно Договору
            чи його виконання,
            обмежується
            1% вартості Послуг
за Договором.</p>
            <p><a name="_GoBack"></a>12.2. Сторони
звільняються
від відповідальності
за часткове
або повне невиконання
зобов'язань
за цим Договором,
якщо це невиконання
стало наслідком
обставин непереборної
сили, які виникли
після укладення
Договору, або
якщо невиконання
зобов'язань
Сторонами за
Договором стало
наслідком подій
надзвичайного
характеру, які
Сторони не
могли ні передбачити,
ні відвернути
розумними
заходами. До
обставин непереборної
сили відносяться
події, на які
Сторона не може
впливати і за
виникнення
яких вона не
несе відповідальності,
зокрема: війна,
повстання,
страйк, землетрус,
повінь, інші
стихійні лиха,
пожежа, збої
енергопостачання,
що сталися не
з вини Сторін,
дії та акти
органів влади,
прийняті після
укладення
Договору, які
роблять неможливим
виконання
зобов'язань,
встановлених
Договором, та
інші непередбачувані
обставини і
непідконтрольні
сторонам події
та явища включно,
але не обмежуючись
зазначеним.</p>
            <p>12.3. Виконавець
            не несе відповідальність
            за дії Замовника
            у Коворкінгу
            перед третіми
особами.</p>
            <p>13. Реквізити
            Виконавця: ФОП
            Стоянов Р.О..,
            ІКПП:  3308020833, адреса:
            54034 м. Миколаїв,
            вул.11 Поздовжня,31-А,
            кв. 31, тел. +380-93-960-20-15,
            паспорт: ЕР
            259002, виданий Ленінським
            РВ ММУ УМВС
            України у
            Миколаївській
області  07.11.2006.</p>

          </div>
        </Modal.Body>
      </ Modal>
    </div>
  );
}

export default ModalPolicy;
